{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.\n",
    "# Например, дается x = 58375.\n",
    "# Нужно вывести максимальную цифру в данном числе, т.е. 8.\n",
    "# Подразумевается, что мы не знаем это число заранее.\n",
    "# Число приходит в виде целого беззнакового.\n",
    "# Подсказки:\n",
    "# * постарайтесь решить задачу с применением арифметики и цикла while;\n",
    "# * при желании и понимании решите задачу с применением цикла for.\n",
    "\n",
    "x = int(input('Введите число x:'))\n",
    "xmax = 0\n",
    "i = x\n",
    " \n",
    "while i:\n",
    "    if i % 10 > xmax:\n",
    "        xmax = i % 10\n",
    "    i //= 10\n",
    "print('Максимальная цифра числа', x, ':', xmax)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Задача-2: Исходные значения двух переменных запросить у пользователя.\n",
    "# Поменять значения переменных местами. Вывести новые значения на экран.\n",
    "# Решите задачу, используя только две переменные.\n",
    "# Подсказки:\n",
    "# * постарайтесь сделать решение через действия над числами;\n",
    "# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.\n",
    "\n",
    "a = int(input('Введите число А:'))\n",
    "b = int(input('Введите число B:'))\n",
    "print('Переменная А:', a, 'Переменная B:', b)\n",
    "print('-----------Меняем местами-----------')\n",
    "a = a + b\n",
    "b = a - b\n",
    "a = a - b\n",
    "print('Переменная А:', a, 'Переменная B:', b)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида\n",
    "# ax² + bx + c = 0.\n",
    "# Коэффициенты уравнения вводятся пользователем.\n",
    "# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:\n",
    "# import math\n",
    "# math.sqrt(4) - вычисляет корень числа 4\n",
    "\n",
    "import math\n",
    "print('__________________________')\n",
    "print('Решение квадратного уравнения a*x^2 + b*x + c = 0')\n",
    "print('Введите коэффициенты уравнения')\n",
    "a = float(input('a ='))\n",
    "b = float(input('b ='))\n",
    "c = float(input('c ='))\n",
    "print(a,'*x^2 +', b, '*x +', c, '= 0')\n",
    "\n",
    "print('Решение:')\n",
    "if a:\n",
    "    d = b*b - 4*a*c\n",
    "    print('d =',d)\n",
    "    if d >= 0:\n",
    "        print('x1 =', (-b + math.sqrt(d)) / (2*a))\n",
    "        print('x2 =', (-b - math.sqrt(d)) / (2*a))\n",
    "    else:\n",
    "        print('Нет решений в вещественных числах')\n",
    "elif b:\n",
    "    print('x =', (-c)/b)\n",
    "elif c:\n",
    "    print('Нет решений')\n",
    "else:\n",
    "    print('x - любое вещественное число')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
